#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xy          0     NONE   float   xy  
; TEXCOORD                 0   xy          1     NONE   float   xy  
; COLOR                    0   xyzw        2     NONE   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; TEXCOORD                 0   xy          1     NONE   float   xy  
; TEXCOORD                 1   xyzw        2     NONE   float   xyzw
;
; shader debug name: b8e131986aa70c7f6573e0678bc2babd.pdb
; shader hash: b8e131986aa70c7f6573e0678bc2babd
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; TEXCOORD                 0                              
; COLOR                    0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.16 (52da17e29)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !37)
!1 = !DIFile(filename: "shaders\5CImGui_VS.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 17, type: !18, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !32}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexOut", file: !1, line: 10, size: 320, align: 32, elements: !21)
!21 = !{!22, !23, !31}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !20, file: !1, line: 12, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "texCoord", scope: !20, file: !1, line: 13, baseType: !24, size: 64, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 1, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 1, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!13, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "tint", scope: !20, file: !1, line: 14, baseType: !4, size: 128, align: 32, offset: 192)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexIn", file: !1, line: 3, size: 256, align: 32, elements: !33)
!33 = !{!34, !35, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !32, file: !1, line: 5, baseType: !24, size: 64, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "texCoord", scope: !32, file: !1, line: 6, baseType: !24, size: 64, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "tint", scope: !32, file: !1, line: 7, baseType: !4, size: 128, align: 32, offset: 128)
!37 = !{!38, !38}
!38 = !DIGlobalVariable(name: "resolution", linkageName: "\01?resolution@@3V?$vector@M$01@@B", scope: !0, file: !1, line: 1, type: !39, isLocal: false, isDefinition: true)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!40 = !{i32 2, !"Dwarf Version", i32 4}
!41 = !{i32 2, !"Debug Info Version", i32 3}
!42 = !{!"dxcoob 1.7.2308.16 (52da17e29)"}
!43 = !{!"shaders\5CImGui_VS.hlsl", !"const float2 resolution : register(b0);\0D\0A\0D\0Astruct VertexIn\0D\0A{\0D\0A\09float2 position : POSITION0;\0D\0A\09float2 texCoord : TEXCOORD0;\0D\0A    float4 tint : COLOR0;\0D\0A};\0D\0A\0D\0Astruct VertexOut\0D\0A{\0D\0A\09float4 position : SV_POSITION;\0D\0A\09float2 texCoord : TEXCOORD0;\0D\0A\09float4 tint : TEXCOORD1;\0D\0A};\0D\0A\0D\0AVertexOut main(VertexIn inVtx)\0D\0A{\0D\0A\09VertexOut outVtx;\0D\0A    outVtx.position = float4((inVtx.position / resolution) * 2.0 - 1.0, 0.0, 1.0);\0D\0A    outVtx.position.y = -outVtx.position.y;\0D\0A    outVtx.texCoord = inVtx.texCoord;\0D\0A    outVtx.tint = inVtx.tint;\0D\0A    return outVtx;\0D\0A}\0D\0A"}
!44 = !{!"shaders\5CImGui_VS.hlsl"}
!45 = !{!"-E", !"main", !"-T", !"vs_6_0", !"/Fo", !"D:\5Cdev2\5Cfp2025\5C\5Cbin\5CDebug\5CImGui_VS.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!46 = !{i32 1, i32 0}
!47 = !{i32 1, i32 7}
!48 = !{!"vs", i32 6, i32 0}
!49 = !{null, null, !50, null}
!50 = !{!51}
!51 = !{i32 0, %"$Globals"* undef, !"$Globals", i32 0, i32 0, i32 1, i32 8, null}
!52 = !{i32 0, %"$Globals" undef, !53}
!53 = !{i32 8, !54}
!54 = !{i32 6, !"resolution", i32 3, i32 0, i32 7, i32 9}
!55 = !{i32 1, void ()* @main, !56}
!56 = !{!57}
!57 = !{i32 0, !2, !2}
!58 = !{[14 x i32] [i32 12, i32 12, i32 1, i32 2, i32 0, i32 0, i32 16, i32 32, i32 0, i32 0, i32 256, i32 512, i32 1024, i32 2048]}
!59 = !{void ()* @main, !"main", !60, !49, !73}
!60 = !{!61, !68, null}
!61 = !{!62, !65, !66}
!62 = !{i32 0, !"POSITION", i8 9, i8 0, !63, i8 0, i32 1, i8 2, i32 0, i8 0, !64}
!63 = !{i32 0}
!64 = !{i32 3, i32 3}
!65 = !{i32 1, !"TEXCOORD", i8 9, i8 0, !63, i8 0, i32 1, i8 2, i32 1, i8 0, !64}
!66 = !{i32 2, !"COLOR", i8 9, i8 0, !63, i8 0, i32 1, i8 4, i32 2, i8 0, !67}
!67 = !{i32 3, i32 15}
!68 = !{!69, !70, !71}
!69 = !{i32 0, !"SV_Position", i8 9, i8 3, !63, i8 4, i32 1, i8 4, i32 0, i8 0, !67}
!70 = !{i32 1, !"TEXCOORD", i8 9, i8 0, !63, i8 2, i32 1, i8 2, i32 1, i8 0, !64}
!71 = !{i32 2, !"TEXCOORD", i8 9, i8 0, !72, i8 2, i32 1, i8 4, i32 2, i8 0, !67}
!72 = !{i32 1}
!73 = !{i32 0, i64 1}
!74 = !DILocation(line: 17, column: 25, scope: !17)
!75 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "outVtx", scope: !17, file: !1, line: 19, type: !20)
!76 = !DIExpression(DW_OP_bit_piece, 192, 32)
!77 = !DILocation(line: 19, column: 12, scope: !17)
!78 = !DIExpression(DW_OP_bit_piece, 224, 32)
!79 = !DIExpression(DW_OP_bit_piece, 256, 32)
!80 = !DIExpression(DW_OP_bit_piece, 288, 32)
!81 = !DIExpression(DW_OP_bit_piece, 128, 32)
!82 = !DIExpression(DW_OP_bit_piece, 160, 32)
!83 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "inVtx", arg: 1, scope: !17, file: !1, line: 17, type: !32)
!84 = !DIExpression(DW_OP_bit_piece, 0, 32)
!85 = !DIExpression(DW_OP_bit_piece, 64, 32)
!86 = !DIExpression(DW_OP_bit_piece, 96, 32)
!87 = !DIExpression(DW_OP_bit_piece, 32, 32)
!88 = !DILocation(line: 20, column: 48, scope: !17)
!89 = !DILocation(line: 20, column: 46, scope: !17)
!90 = !DILocation(line: 20, column: 60, scope: !17)
!91 = !DILocation(line: 20, column: 66, scope: !17)
!92 = !DILocation(line: 20, column: 21, scope: !17)
!93 = !DILocation(line: 21, column: 25, scope: !17)
!94 = !DILocation(line: 21, column: 23, scope: !17)
!95 = !DILocation(line: 22, column: 21, scope: !17)
!96 = !DILocation(line: 23, column: 17, scope: !17)
!97 = !DILocation(line: 24, column: 12, scope: !17)
!98 = !DILocation(line: 24, column: 5, scope: !17)

#endif

const unsigned char ImGui_VS[] = {
